apache/nuttx/arch/mips/src/pic32mz/pic32mz_dma.c
/****************************************************************************
 * arch/mips/src/pic32mz/pic32mz_dma.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/mutex.h>

#include "mips_internal.h"
#include "sched/sched.h"

#include "hardware/pic32mz_dma.h"
#include "pic32mz_dma.h"

#ifdef CONFIG_PIC32MZ_DMA

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Convert a virtual address to a physical address */

#define PHYS_ADDR(va) ((uint32_t)(va) & 0x1fffffff)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes one DMA channel */

struct pic32mz_dmach_s
{
  uint8_t        chan;            /* DMA channel number (0-8) */
  uint8_t        irq;             /* DMA channel IRQ number */
  uint32_t       base;            /* DMA register channel base address */
  bool           inuse;           /* true: The DMA channel is in use */
  dma_callback_t callback;        /* Callback invoked when the DMA completes */
  void          *arg;             /* Argument passed to callback function */
  struct pic32mz_dma_chcfg_s cfg; /* Channel's config */
};

/* This structure describes the state of the DMA controller */

struct pic32mz_dmac_s
{
  /* Protects the channels' table */

  mutex_t chlock;

  /* Describes all DMA channels */

  struct pic32mz_dmach_s dmachs[CHIP_NDMACH];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t pic32mz_dma_getreg(struct pic32mz_dmach_s *dmach,
                                          uint8_t offset);
static inline void pic32mz_dma_putreg(struct pic32mz_dmach_s *dmach,
                                      uint8_t offset, uint32_t value);
static inline void pic32mz_dma_modifyreg(struct pic32mz_dmach_s *dmach,
                                         uint8_t offset,
                                         uint32_t clrbits, uint32_t setbits);
static inline uint32_t pic32mz_dma_getglobal(uint8_t offset);
static inline void pic32mz_dma_putglobal(uint8_t offset, uint32_t value);

static inline void pic32mz_dma_enable(struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_disable(struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_priority(struct pic32mz_dmach_s *dmach,
                                        uint8_t priority);
static inline void pic32mz_dma_srcaddr(struct pic32mz_dmach_s *dmach,
                                       uint32_t addr);
static inline void pic32mz_dma_destaddr(struct pic32mz_dmach_s *dmach,
                                        uint32_t addr);
static inline void pic32mz_dma_srcsize(struct pic32mz_dmach_s *dmach,
                                       uint16_t size);
static inline void pic32mz_dma_destsize(struct pic32mz_dmach_s *dmach,
                                        uint16_t size);
static inline void pic32mz_dma_cellsize(struct pic32mz_dmach_s *dmach,
                                        uint16_t size);
static inline void pic32mz_dma_startirq(struct pic32mz_dmach_s *dmach,
                                        int irq);
static inline void pic32mz_dma_forcestart(struct pic32mz_dmach_s *dmach);
static inline void pic32mz_dma_abortirq(struct pic32mz_dmach_s *dmach,
                                        int irq);
static inline void pic32mz_dma_forceabort(struct pic32mz_dmach_s *dmach);

static inline void pic32mz_dma_intctrl(struct pic32mz_dmach_s *dmach,
                                       uint8_t cfg);
static inline void pic32mz_dma_intclr(struct pic32mz_dmach_s *dmach);
static int pic32mz_dma_interrupt(int irq, void *context, void *arg);

static void pic32mz_dma_mode(struct pic32mz_dmach_s *dmach,
                             uint8_t mode);
static void pic32mz_dma_config(struct pic32mz_dmach_s *dmach,
                               const struct pic32mz_dma_chcfg_s *cfg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This array describes the state of each DMA */

static struct pic32mz_dmac_s g_dmac =
{
  .chlock = NXMUTEX_INITIALIZER,
  .dmachs =
    {
      {
        .chan = 0,
        .irq  = PIC32MZ_IRQ_DMA0,
        .base = PIC32MZ_DMACH0_K1BASE,
      },
      {
        .chan = 1,
        .irq  = PIC32MZ_IRQ_DMA1,
        .base = PIC32MZ_DMACH1_K1BASE,
      },
      {
        .chan = 2,
        .irq  = PIC32MZ_IRQ_DMA2,
        .base = PIC32MZ_DMACH2_K1BASE,
      },
      {
        .chan = 3,
        .irq  = PIC32MZ_IRQ_DMA3,
        .base = PIC32MZ_DMACH3_K1BASE,
      },
      {
        .chan = 4,
        .irq  = PIC32MZ_IRQ_DMA4,
        .base = PIC32MZ_DMACH4_K1BASE,
      },
      {
        .chan = 5,
        .irq  = PIC32MZ_IRQ_DMA5,
        .base = PIC32MZ_DMACH5_K1BASE,
      },
      {
        .chan = 6,
        .irq  = PIC32MZ_IRQ_DMA6,
        .base = PIC32MZ_DMACH6_K1BASE,
      },
      {
        .chan = 7,
        .irq  = PIC32MZ_IRQ_DMA7,
        .base = PIC32MZ_DMACH7_K1BASE,
      },
    }
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_dma_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t pic32mz_dma_getreg(struct pic32mz_dmach_s *dmach,
                                          uint8_t offset)
{
  return getreg32(dmach->base + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_putreg(struct pic32mz_dmach_s *dmach,
                                      uint8_t offset, uint32_t value)
{
  putreg32(value, dmach->base + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_modifyreg
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_modifyreg(struct pic32mz_dmach_s *dmach,
                                         uint8_t offset,
                                         uint32_t clrbits, uint32_t setbits)
{
  modifyreg32(dmach->base + offset, clrbits, setbits);
}

/****************************************************************************
 * Name: pic32mz_dma_getglobal
 *
 * Description:
 *   Get a 32-bit global register value by offset
 *
 ****************************************************************************/

static inline uint32_t pic32mz_dma_getglobal(uint8_t offset)
{
  return getreg32(PIC32MZ_DMA_K1BASE + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_putglobal
 *
 * Description:
 *   Put a 32-bit global register value by offset
 *
 ****************************************************************************/

static inline void pic32mz_dma_putglobal(uint8_t offset, uint32_t value)
{
  putreg32(value, PIC32MZ_DMA_K1BASE + offset);
}

/****************************************************************************
 * Name: pic32mz_dma_enable
 *
 * Description:
 *  Enable the DMA channel.
 *
 ****************************************************************************/

static inline void pic32mz_dma_enable(struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMA_CONSET_OFFSET, DMACH_CON_CHEN);
}

/****************************************************************************
 * Name: pic32mz_dma_disable
 *
 * Description:
 *  Disable the DMA channel.
 *
 ****************************************************************************/

