apache/nuttx/arch/mips/src/pic32mz/pic32mz_dma.c
static inline void pic32mz_dma_disable(struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMA_CONCLR_OFFSET, DMACH_CON_CHEN);
}

/****************************************************************************
 * Name: pic32mz_dma_priority
 *
 * Description:
 *   Set the channel's priority.
 *
 ****************************************************************************/

static inline void pic32mz_dma_priority(struct pic32mz_dmach_s *dmach,
                                        uint8_t priority)
{
  /* Highest priority is 3. */

  if (priority <= 3)
    {
      pic32mz_dma_modifyreg(dmach, PIC32MZ_DMA_CON_OFFSET,
                            DMACH_CON_CHPRI_MASK,
                            priority << DMACH_CON_CHPRI_SHIFT);
    }
}

/****************************************************************************
 * Name: pic32mz_dma_srcaddr
 *
 * Description:
 *   Set the channel's source address.
 *
 ****************************************************************************/

static inline void pic32mz_dma_srcaddr(struct pic32mz_dmach_s *dmach,
                                       uint32_t addr)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_SSA_OFFSET, PHYS_ADDR(addr));
}

/****************************************************************************
 * Name: pic32mz_dma_destaddr
 *
 * Description:
 *   Set the channel's destination address.
 *
 ****************************************************************************/

static inline void pic32mz_dma_destaddr(struct pic32mz_dmach_s *dmach,
                                        uint32_t addr)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_DSA_OFFSET, PHYS_ADDR(addr));
}

/****************************************************************************
 * Name: pic32mz_dma_srcsize
 *
 * Description:
 *   Set the channel's source size.
 *
 ****************************************************************************/

static inline void pic32mz_dma_srcsize(struct pic32mz_dmach_s *dmach,
                                       uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_SSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_destsize
 *
 * Description:
 *   Set the channel's destination size.
 *
 ****************************************************************************/

static inline void pic32mz_dma_destsize(struct pic32mz_dmach_s *dmach,
                                        uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_DSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_cellsize
 *
 * Description:
 *   Set the channel's cell size.
 *
 ****************************************************************************/

static inline void pic32mz_dma_cellsize(struct pic32mz_dmach_s *dmach,
                                        uint16_t size)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_CSIZ_OFFSET, size);
}

/****************************************************************************
 * Name: pic32mz_dma_startirq
 *
 * Description:
 *   Set the channel's start irq.
 *
 ****************************************************************************/

static inline void pic32mz_dma_startirq(struct pic32mz_dmach_s *dmach,
                                        int irq)
{
  /* Enable start irq matching. */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_SIRQEN);

  /* Clear the field before setting it. */

  pic32mz_dma_modifyreg(dmach, PIC32MZ_DMACH_ECON_OFFSET,
                        DMACH_ECON_CHSIRQ_MASK,
                        irq << DMACH_ECON_CHSIRQ_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_forcestart
 *
 * Description:
 *   Initiate the transfer by software.
 *
 ****************************************************************************/

static inline void pic32mz_dma_forcestart(struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_CFORCE);
}

/****************************************************************************
 * Name: pic32mz_dma_abortirq
 *
 * Description:
 *   Set the channel's abort irq.
 *
 ****************************************************************************/

static inline void pic32mz_dma_abortirq(struct pic32mz_dmach_s *dmach,
                                        int irq)
{
  /* Enable abort irq matching. */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_AIRQEN);

  /* Clear the field before setting it. */

  pic32mz_dma_modifyreg(dmach, PIC32MZ_DMACH_ECON_OFFSET,
                        DMACH_ECON_CHAIRQ_MASK,
                        irq << DMACH_ECON_CHAIRQ_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_forceabort
 *
 * Description:
 *   Initiate the transfer by software.
 *
 ****************************************************************************/

static inline void pic32mz_dma_forceabort(struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONSET_OFFSET, DMACH_ECON_CABORT);
}

/****************************************************************************
 * Name: pic32mz_dma_intclr
 *
 * Description:
 *  Clears the channel's interrupt flags.
 *
 ****************************************************************************/

static inline void pic32mz_dma_intclr(struct pic32mz_dmach_s *dmach)
{
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTCLR_OFFSET,
                     DMACH_INT_FLAGS_MASK);
}

/****************************************************************************
 * Name: pic32mz_dma_intctrl
 *
 * Description:
 *  Enables the different interrupt's flags.
 *
 ****************************************************************************/

static inline void pic32mz_dma_intctrl(struct pic32mz_dmach_s *dmach,
                                       uint8_t cfg)
{
  /* Clear all interrupts flags */

  pic32mz_dma_intclr(dmach);

  /* Disable previous interrupts */

  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTCLR_OFFSET,
                     DMACH_INT_EN_MASK);

  /* Enable the interrupts requested. */

