apache/nuttx/arch/mips/src/pic32mz/pic32mz_dma.c
  pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_INTSET_OFFSET,
                     cfg << DMACH_INT_EN_SHIFT);
}

/****************************************************************************
 * Name: pic32mz_dma_interrupt
 *
 * Description:
 *  DMA interrupt handler.
 *
 ****************************************************************************/

static int pic32mz_dma_interrupt(int irq, void *context, void *arg)
{
  struct pic32mz_dmach_s *dmach;
  uint8_t status;
  int chndx = 0;

  /* Get the channel structure from the irq. */

  chndx = irq - PIC32MZ_IRQ_DMA0;
  dmach = &g_dmac.dmachs[chndx];

  /* Get the interrupt status. */

  status = (uint8_t)(pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_INT_OFFSET) &
                     DMACH_INT_FLAGS_MASK);

  /* Clear the interrupt flags. */

  mips_clrpend_irq(dmach->irq);
  pic32mz_dma_intclr(dmach);

  /* Invoke the callback. */

  if (dmach->callback)
    {
      dmach->callback(dmach, status, dmach->arg);
    }

  return OK;
}

/****************************************************************************
 * Name: pic32mz_dma_mode
 *
 * Description:
 *   Set the channel's mode
 *
 ****************************************************************************/

static void pic32mz_dma_mode(struct pic32mz_dmach_s *dmach,
                             uint8_t mode)
{
  if (mode & PIC32MZ_DMA_MODE_BASIC)
    {
      /* Basic mode doesn't need any config */
    }

  if (mode & PIC32MZ_DMA_MODE_AUTOEN)
    {
      pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_CONSET_OFFSET,
                         DMACH_CON_CHAEN);
    }
}

/****************************************************************************
 * Name: pic32mz_dma_config
 *
 * Description:
 *   Config the DMA channel
 *
 ****************************************************************************/

static void pic32mz_dma_config(struct pic32mz_dmach_s *dmach,
                               const struct pic32mz_dma_chcfg_s *cfg)
{
  /* Set the channel's priority */

  pic32mz_dma_priority(dmach, cfg->priority);

  /* Set the channel's start and abort IRQs if they are specified */

  if (cfg->startirq != PIC32MZ_DMA_NOIRQ)
    {
      pic32mz_dma_startirq(dmach, cfg->startirq);
    }
  else
    {
      pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONCLR_OFFSET,
                         DMACH_ECON_SIRQEN);
    }

  if (cfg->abortirq != PIC32MZ_DMA_NOIRQ)
    {
      pic32mz_dma_abortirq(dmach, cfg->abortirq);
    }
  else
    {
      pic32mz_dma_putreg(dmach, PIC32MZ_DMACH_ECONCLR_OFFSET,
                         DMACH_ECON_AIRQEN);
    }

  /* Set the interrupt event(s) */

  pic32mz_dma_intctrl(dmach, cfg->event);

  /* Set the channel's mode */

  pic32mz_dma_mode(dmach, cfg->mode);

  /* Copy the config */

  dmach->cfg = *cfg;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: pic32mz_dma_sample
 *
 * Description:
 *   Sample DMA register contents
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA
void pic32mz_dma_sample(DMA_HANDLE handle, struct pic32mz_dmaregs_s *regs)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;
  irqstate_t flags;

  flags = enter_critical_section();

  regs->gbl.con = pic32mz_dma_getglobal(PIC32MZ_DMA_CON_OFFSET);
  regs->gbl.stat = pic32mz_dma_getglobal(PIC32MZ_DMA_STAT_OFFSET);
  regs->gbl.addr = pic32mz_dma_getglobal(PIC32MZ_DMA_ADDR_OFFSET);

  regs->crc.con = pic32mz_dma_getglobal(PIC32MZ_DMA_CRCCON_OFFSET);
  regs->crc.data = pic32mz_dma_getglobal(PIC32MZ_DMA_CRCDATA_OFFSET);
  regs->crc.xor  = pic32mz_dma_getglobal(PIC32MZ_DMA_CRCXOR_OFFSET);

  regs->ch.con = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_CON_OFFSET);
  regs->ch.econ = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_ECON_OFFSET);
  regs->ch.intcon = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_INT_OFFSET);
  regs->ch.ssa = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_SSA_OFFSET);
  regs->ch.dsa = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_DSA_OFFSET);
  regs->ch.ssiz  = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_SSIZ_OFFSET);
  regs->ch.dsiz = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_DSIZ_OFFSET);
  regs->ch.sptr = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_SPTR_OFFSET);
  regs->ch.dptr  = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_DPTR_OFFSET);
  regs->ch.csiz = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_CSIZ_OFFSET);
  regs->ch.cptr = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_CPTR_OFFSET);
  regs->ch.dat  = pic32mz_dma_getreg(dmach, PIC32MZ_DMACH_DAT_OFFSET);

  leave_critical_section(flags);
}
#endif

/****************************************************************************
 * Name: pic32mz_dma_dump
 *
 * Description:
 *   Dump previously sampled DMA register contents
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG_DMA
void pic32mz_dma_dump(DMA_HANDLE handle,
                      const struct pic32mz_dmaregs_s *regs,
                      const char *msg)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  dmainfo("DMA Registers: %s\n", msg);
  dmainfo("  DMACON: %08x\n", regs->gbl.con);
  dmainfo("  DMASTAT: %08x\n", regs->gbl.stat);
  dmainfo("  DMAADDR: %08x\n", regs->gbl.addr);

  dmainfo("  DCRCCON: %08x\n", regs->crc.con);
  dmainfo("  DCRCDATA: %08x\n", regs->crc.data);
  dmainfo("  DCRCXOR: %08x\n", regs->crc.xor);

  dmainfo("  DCHCON[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_CON_OFFSET,
                                    regs->gbl.con);
  dmainfo("  DCHECON[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_ECON_OFFSET,
                                     regs->gbl.stat);
  dmainfo("  DCHINT[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_INT_OFFSET,
                                    regs->gbl.addr);
  dmainfo("  DCHSSA[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_SSA_OFFSET,
                                    regs->crc.con);
  dmainfo("  DCHDSA[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_DSA_OFFSET,
                                    regs->crc.data);
  dmainfo("  DCHSSIZ[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_SSIZ_OFFSET,
                                     regs->crc.xor);
  dmainfo("  DCHDSIZ[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_DSIZ_OFFSET,
                                     regs->gbl.con);
  dmainfo("  DCHSPTR[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_SPTR_OFFSET,
                                     regs->gbl.stat);
  dmainfo("  DCHDPTR[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_DPTR_OFFSET,
                                     regs->gbl.addr);
  dmainfo("  DCHCSIZ[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_CSIZ_OFFSET,
                                     regs->crc.con);
  dmainfo("  DCHCPTR[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_CPTR_OFFSET,
                                     regs->crc.data);
  dmainfo("  DCHDAT[%08x]: %08x\n", dmach->base + PIC32MZ_DMACH_DAT_OFFSET,
                                    regs->crc.xor);
}
#endif

/****************************************************************************
 * Name: pic32mz_dma_initialize
 *
 * Description:
 *   Initialize the DMA subsystem.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

