apache/nuttx/arch/mips/src/pic32mz/pic32mz_dma.c
void weak_function mips_dma_initialize(void)
{
  struct pic32mz_dmach_s *dmach;
  int i;

  /* Initialize each DMA channel. */

  for (i = 0; i < CHIP_NDMACH; i++)
    {
      dmach = &g_dmac.dmachs[i];

      dmach->inuse = false;

      /* Attach DMA interrupt vectors. */

      irq_attach(dmach->irq, pic32mz_dma_interrupt, NULL);

      /* Disable the DMA channel. */

      pic32mz_dma_disable(dmach);

      /* Set channel priority to zero. */

      pic32mz_dma_priority(dmach, 0);

      /* Clear any pending interrupts */

      pic32mz_dma_intclr(dmach);
      mips_clrpend_irq(dmach->irq);

      /* Enable the IRQ. */

      up_enable_irq(dmach->irq);
    }

  /* Enable the DMA module. */

  pic32mz_dma_putglobal(PIC32MZ_DMA_CONSET_OFFSET, DMA_CON_ON);
}

/****************************************************************************
 * Name: pic32mz_dma_alloc
 *
 * Description:
 *   Allocate a DMA channel.  This function sets aside a DMA channel and
 *   gives the caller exclusive access to the DMA channel.
 *
 * Returned Value:
 *   On success, this function returns a non-NULL, void* DMA channel handle.
 *   NULL is returned on any failure.
 *   This function can fail only if no DMA channel is available.
 *
 ****************************************************************************/

DMA_HANDLE pic32mz_dma_alloc(const struct pic32mz_dma_chcfg_s *cfg)
{
  struct pic32mz_dmach_s *dmach = NULL;
  unsigned int chndx;
  int ret;

  /* Search for an available DMA channel */

  ret = nxmutex_lock(&g_dmac.chlock);
  if (ret < 0)
    {
      return NULL;
    }

  for (chndx = 0; chndx < CHIP_NDMACH; chndx++)
    {
      struct pic32mz_dmach_s *candidate = &g_dmac.dmachs[chndx];

      if (!candidate->inuse)
        {
          dmach = candidate;
          dmach->inuse = true;

          DEBUGASSERT(chndx == dmach->chan);

          /* Clear any pending interrupts on the channel */

          pic32mz_dma_intclr(dmach);
          mips_clrpend_irq(dmach->irq);

          /* Disable the channel */

          pic32mz_dma_disable(dmach);

          /* Config this channel */

          if (cfg != NULL)
            {
              pic32mz_dma_config(dmach, cfg);
            }

          break;
        }
    }

  nxmutex_unlock(&g_dmac.chlock);

  /* Show the result of the allocation */

  if (dmach != NULL)
    {
      dmainfo("CH%d: returning dmach: %p\n", dmach->chan, dmach);
    }
  else
    {
      dmaerr("ERROR: Failed to allocate a DMA channel\n");
    }

  return (DMA_HANDLE)dmach;
}

/****************************************************************************
 * Name: pic32mz_dma_free
 *
 * Description:
 *   Release a DMA channel.
 *   NOTE:  The 'handle' used in this argument must NEVER be used again until
 *   pic32mz_dma_alloc() is called again to re-gain a valid handle.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void pic32mz_dma_free(DMA_HANDLE handle)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  DEBUGASSERT(handle != NULL);

  /* Mark the channel as no longer in use */

  dmach->inuse = false;

  /* Disable the channel */

  pic32mz_dma_disable(dmach);

  /* Clear any pending interrupt */

  pic32mz_dma_intclr(dmach);
  mips_clrpend_irq(dmach->irq);
}

/****************************************************************************
 * Name: pic32mz_dma_chcfg
 *
 * Description:
 *   Configure a DMA channel.
 *   This config can be done during alloc, however if reconfig is needed,
 *   this functions should be used.
 *
 ****************************************************************************/

int pic32mz_dma_chcfg(DMA_HANDLE handle,
                      const struct pic32mz_dma_chcfg_s *cfg)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  DEBUGASSERT(dmach != NULL);

  pic32mz_dma_config(dmach, cfg);

  return OK;
}

/****************************************************************************
 * Name: pic32mz_dma_xfrsetup
 *
 * Description:
 *   Configure DMA for one transfer.
 *
 ****************************************************************************/

int pic32mz_dma_xfrsetup(DMA_HANDLE handle,
                         const struct pic32mz_dma_xfrcfg_s *cfg)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  DEBUGASSERT(dmach != NULL);

  /* Set source and destination addresses */

  pic32mz_dma_srcaddr(dmach, cfg->srcaddr);
  pic32mz_dma_destaddr(dmach, cfg->destaddr);

  /* Set transfer size (source, destination and cell) */

  pic32mz_dma_srcsize(dmach,  cfg->srcsize);
  pic32mz_dma_destsize(dmach, cfg->destsize);
  pic32mz_dma_cellsize(dmach, cfg->cellsize);

  return OK;
}

/****************************************************************************
 * Name: pic32mz_dma_start
 *
 * Description:
 *   Start the DMA transfer
 *
 ****************************************************************************/

int pic32mz_dma_start(DMA_HANDLE handle, dma_callback_t callback, void *arg)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  DEBUGASSERT(dmach != NULL);

  /* Save the callback info */

  dmach->callback = callback;
  dmach->arg      = arg;

  /* Enable the channel */

  pic32mz_dma_enable(dmach);

  /* If no irq is set to start the channel, force it */

  if (dmach->cfg.startirq == PIC32MZ_DMA_NOIRQ)
    {
      pic32mz_dma_forcestart(dmach);
    }

  return OK;
}

/****************************************************************************
 * Name: pic32mz_dma_stop
 *
 * Description:
 *   Cancel the DMA.
 *   After pic32mz_dma_stop() is called, the DMA channel is reset
 *   and pic32mz_dma_xfrsetup() must be called before pic32mz_dma_start()
 *   can be called again.
 *
 ****************************************************************************/

void pic32mz_dma_stop(DMA_HANDLE handle)
{
  struct pic32mz_dmach_s *dmach = (struct pic32mz_dmach_s *)handle;

  DEBUGASSERT(dmach != NULL);

  /* Abort the transfer and disable the channel */

  pic32mz_dma_forceabort(dmach);
  pic32mz_dma_disable(dmach);

  /* Clear any pending interrupts */

  pic32mz_dma_intclr(dmach);
  mips_clrpend_irq(dmach->irq);
}

#endif /* CONFIG_PIC32MZ_DMA */
